In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [2]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                   'k2':['alpha','beta','alpha','beta','alpha'],
                   'dataset1':np.random.randn(5),
                   'dataset2':np.random.randn(5)})
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  1.211296 -0.518717
1  X   beta -1.526870 -1.591988
2  Y  alpha -0.879716  1.816189
3  Y   beta  0.603580  0.079998
4  Z  alpha -0.623673  0.605493

In [3]:
#group dataset1 by k1
group1 = dframe['dataset1'].groupby(dframe['k1'])
group1

In [4]:
group1.mean()

k1
X   -0.157787
Y   -0.138068
Z   -0.623673
Name: dataset1, dtype: float64

In [5]:
cities = np.array(['NY','LA','LA','NY','NY'])

month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [8]:
# maps the cities month to dataframe and performs mean() operation
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB   -1.526870
    JAN   -0.879716
NY  FEB    0.603580
    JAN    0.293811
Name: dataset1, dtype: float64

In [9]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  1.211296 -0.518717
1  X   beta -1.526870 -1.591988
2  Y  alpha -0.879716  1.816189
3  Y   beta  0.603580  0.079998
4  Z  alpha -0.623673  0.605493

In [10]:
# pass column names as group key
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -0.157787 -1.055353
Y  -0.138068  0.948094
Z  -0.623673  0.605493

In [11]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  1.211296 -0.518717
   beta  -1.526870 -1.591988
Y  alpha -0.879716  1.816189
   beta   0.603580  0.079998
Z  alpha -0.623673  0.605493

In [12]:
#get the size or count
dframe.groupby('k1').size()

k1
X    2
Y    2
Z    1
dtype: int64

In [19]:
# iterate through groups 
for name,group in dframe.groupby('k1'):
    print("This is the %s group"%name)
    print(group)
    print("\n")

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha  1.211296 -0.518717
1  X   beta -1.526870 -1.591988


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -0.879716  1.816189
3  Y   beta  0.603580  0.079998


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha -0.623673  0.605493

In [23]:
#iterrate through both keys
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print("Key1 = %s Key2 = %s"%(k1,k2))
    print(group)
    print("\n")

Key1 = X Key2 = alpha
  k1     k2  dataset1  dataset2
0  X  alpha  1.211296 -0.518717


Key1 = X Key2 = beta
  k1    k2  dataset1  dataset2
1  X  beta  -1.52687 -1.591988


Key1 = Y Key2 = alpha
  k1     k2  dataset1  dataset2
2  Y  alpha -0.879716  1.816189


Key1 = Y Key2 = beta
  k1    k2  dataset1  dataset2
3  Y  beta   0.60358  0.079998


Key1 = Z Key2 = alpha
  k1     k2  dataset1  dataset2
4  Z  alpha -0.623673  0.605493

In [26]:
#group by using data types
dict(list(dframe.groupby(dframe.dtypes, axis=1)))

{dtype('float64'):    dataset1  dataset2
 0  1.211296 -0.518717
 1 -1.526870 -1.591988
 2 -0.879716  1.816189
 3  0.603580  0.079998
 4 -0.623673  0.605493, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [28]:
# group by with columns
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

dataset2_group.mean()

          dataset2
k1 k2
X  alpha -0.518717
   beta  -1.591988
Y  alpha  1.816189
   beta   0.079998
Z  alpha  0.605493